{
  "nickname": "Jade",
  "lastname": "Chaykaew",

  "about": "អំពី",
  "skills": "ជំនាញ",
  "experience": "បទពិសោធន៍",
  "work": "គម្រោង",
  "education": "ការអប់រំ",
  "rights": "© 2025 Jade Chaykaew. All rights reserved.",

  "componentAbout": {
    "line1": "សួស្តី",
    "line2": "ខ្ញុំឈ្ម ចេតសាដាព្រះ ជាយកែវ",
    "line3": "ខ្ញុំជា ក ",
    "line4": "ខ្ញុំជាអ្នកអភិវឌ្ឍកម្មវិធី Android ដោយប្រើភាសា Kotlin និង Java និងជាអ្នកអភិវឌ្ឍកម្មវិធី Desktop ដោយប្រើភាសា Python។",
    "line5": "ខ្ញុំធ្វើការជា IT Support នៅក្រុមហ៊ុន ID-Home2015 Co., Ltd. ដែលស្ថិតនៅស្រុកប្រាសាទ ខេត្តសូរីន ជាមួយបទពិសោធន៍ការងារ ២ឆ្នាំ។",
    "line6": "ខ្ញុំមានជំនាញអភិវឌ្ឍកម្មវិធីសម្រាប់ការរកឃើញនិងចាត់ថ្នាក់វត្ថុ ដោយប្រើម៉ូឌែល YOLO, ONNX, និង NCNN។",
    "line7": "ខ្ញុំមានជំនាញក្នុងការថែទាំកុំព្យូទ័រ បច្ចុប្បន្នភាពផ្នែក Hardware ដំឡើង Software និងប្រព័ន្ធប្រតិបត្តិការ OS។",
    "line8": "ខ្ញុំក៏មានជំនាញក្នុងការថែទាំ និងដំឡើងប្រព័ន្ធកាមេរ៉ាសុវត្ថិភាព Analog និង Digital។",
    "line9": "បើទោះបីខ្ញុំមិនទាន់មានបទពិសោធន៍ផ្ទាល់ក្នុងវិស័យនេះក៏ដោយ ខ្ញុំមានចំណង់ចំណូលចិត្តក្នុងការស្វែងយល់របស់ថ្មីៗ ឧស្សាហ៍ព្យាយាមអភិវឌ្ឍខ្លួនឯង និងអាចសម្របខ្លួនឲ្យសមនឹងការងារបានយ៉ាងរហ័ស។",
    "line10": "មិនដឹងមិនជាប់ពាក់ព័ន្ធទេ តែសំខាន់គឺកុំឈប់ស្វែងយល់។"
  },

  "componentExperience": {
    "skillsTitle": "ជំនាញ",
    "id1": {
      "company": "ក្រុមហ៊ុន ID-Home2015",
      "date": "កញ្ញា ២០២៣ - បច្ចុប្បន្ន",
      "desc": "ផ្តល់ការគាំទ្រ និងដោះស្រាយបញ្ហាផ្នែក IT ទាំងផ្នែកផ្នែកឧបករណ៍ និងកម្មវិធី។ ថែទាំឧបករណ៍ IT និងប្រព័ន្ធបណ្ដាញ។ ជួសជុល និងដំឡើងប្រព័ន្ធកាមេរ៉ាសុវត្ថិភាព (CCTV)। គ្រប់គ្រង និងដោះស្រាយបញ្ហាមូលដ្ឋាននៃប្រព័ន្ធម៉ាស៊ីនមេ (Server) និងអភិវឌ្ឍកម្មវិធីជួយការងារសម្រាប់នាយកដ្ឋានក្នុងក្រុមហ៊ុន។"
    },
    "id2": {
      "company": "គម្រោងផ្ទាល់ខ្លួន",
      "date": "២០២១ - បច្ចុប្បន្ន",
      "desc": "អភិវឌ្ឍកម្មវិធីចាប់វត្ថុបែបពេលពិតលើ Android ដោយប្រើម៉ូឌែល YOLO បំលែងទៅ NCNN សម្រាប់បង្កើនប្រសិទ្ធភាពលើឧបករណ៍ចល័ត។ បង្កើតដោយភាសា Kotlin និងភ្ជាប់ជាមួយ Native C++ តាមរយៈ JNI។ ទិន្នន័យពេលពិតត្រូវបានកត់ត្រាតាមរយៈ Firebase។"
    },
    "id3": {
      "company": "គម្រោងផ្ទាល់ខ្លួន",
      "date": "២០២១ - បច្ចុប្បន្ន",
      "desc": "អភិវឌ្ឍកម្មវិធី Desktop ដោយប្រើភាសា Python សម្រាប់គ្រប់គ្រងឧបករណ៍ Android តាមរយៈ ADB និងថតរូបអេក្រង់ដោយប្រើ Scrcpy។ អភិវឌ្ឍប្រព័ន្ធចាប់វត្ថុបែបពេលពិតដោយប្រើម៉ូឌែល YOLO បំលែងទៅ ONNX ដើម្បីបង្កើនប្រសិទ្ធភាព។ ការកត់ត្រាទិន្នន័យពេលពិតត្រូវបានធ្វើតាមរយៈ Firebase។"
    }
  },

  "componentEducation": {
    "grade": "GPA ",
    "id1": {
      "degree": "បច្ចេកវិទ្យាព័ត៌មាន",
      "school": "Surindra Rajabhat University",
      "date": "សីហា ២០១៥ - មីនា ២០១៩",
      "desc": "បានបញ្ចប់ការសិក្សាថ្នាក់បរិញ្ញាបត្រ វិទ្យាសាស្ត្រជំនាញបច្ចេកវិទ្យាព័ត៌មាន។"
    },
    "id2": {
      "degree": "វិទ្យាល័យ",
      "school": "Naengmud Witthaya School",
      "date": "ឧសភា ២០១២ - មីនា ២០១៥",
      "desc": "បានបញ្ចប់ការសិក្សាថ្នាក់វិទ្យាល័យ នៅសាលា Naengmud Witthaya ស្ថិតនៅឃុំព្រំដែន Nang Mud ស្រុកកាបជើង ខេត្តសុរិន។"
    },
    "id3": {
      "degree": "មធ្យមសិក្សាដំបូង",
      "school": "Naengmud Witthaya School",
      "date": "ឧសភា ២០០៩ - មីនា ២០១២",
      "desc": "បានបញ្ចប់មធ្យមសិក្សាដំបូង នៅសាលា Naengmud Witthaya ស្ថិតនៅឃុំព្រំដែន Nang Mud ស្រុកកាបជើង ខេត្តសុរិន។"
    },
    "id4": {
      "degree": "បឋមសិក្សា",
      "school": "NikhomSangTonEngPrasat2 School",
      "date": "",
      "desc": "បានបញ្ចប់ការសិក្សាថ្នាក់បឋមសិក្សា នៅសាលា Nikhom Sang Ton Eng Prasat 2 ស្ថិតនៅឃុំព្រំដែន Nang Mud ស្រុកកាបជើង ខេត្តសុរិន។"
    }
  }
}
