{
  "nickname": "Jade",
  "lastname": "Chaykaew",

  "about": "เกี่ยวกับ",
  "skills": "ทักษะ",
  "experience": "ประสบการณ์",
  "work": "ผลงาน",
  "education": "การศึกษา",
  "rights": "© 2025 Jade Chaykaew. All rights reserved.",

  "componentAbout": {
    "line1": "สวัสดี",
    "line2": "ผม เจษฎาภรณ์ ชายแก้ว",
    "line3": "ผมเป็น ",
    "line4": "ผมเป็นนักพัฒนา Android Application โดยใช้ภาษา Kotlin, Java และเป็นนักพัฒนา Desktop Application โดยใช้ภาษา Python",
    "line5": "ผมเป็น IT Support ให้กับ บริษัท ไอดีโฮม2015 จำกัด ที่ อำเภอปราสาท จังหวัดสุรินทร์ ประสบการณ์ทำงาน 2 ปี",
    "line6": "ผมมีทักษะการพัฒนาซอฟต์แวร์สำหรับตรวจจับและจำแนกวัตถุด้วยโมเดลของ YOLO, ONNX, NCNN",
    "line7": "ผมมีทักษะการซ่อมบํารุงคอมพิวเตอร์ Update Hardware ติดตั้ง Software และ ติดตั้ง OS",
    "line8": "ผมมีทักษะการซ่อมบํารุงและติดตั้ง ระบบ CCTV Analog, Digital",
    "line9": "ถึงแม้ผมจะยังไม่มีประสบการณ์ตรงในสายงาน แต่ผมมีความตั้งใจที่จะเรียนรู้สิ่งใหม่ พร้อมพัฒนาตัวเอง และปรับตัวเข้ากับการทำงานได้อย่างรวดเร็ว",
    "line10": "ไม่รู้ ไม่เป็นไร แค่ไม่หยุดที่จะเรียนรู้"
  },

  "componentExperience": {
    "skillsTitle": "ทักษะ",
    "id1": {
      "company": "บริษัท ไอดีโฮม 2015 จำกัด",
      "date": "กันยายน 2566 - ปัจจุบัน",
      "desc": "ให้การสนับสนุนและแก้ไขปัญหาด้าน IT ทั้งฮาร์ดแวร์และซอฟต์แวร์ ตรวจสอบและบำรุงรักษาอุปกรณ์ IT และระบบเครือข่าย ซ่อมแซมและติดตั้งกล้องวงจรปิด (CCTV) ดูแลและแก้ไขปัญหาเบื้องต้นของระบบ Server รวมถึงพัฒนาโปรแกรมเพื่ออำนวยความสะดวกให้กับหน่วยงานภายในบริษัท"
    },
    "id2": {
      "company": "งานส่วนตัว",
      "date": "2564 - ปัจจุบัน",
      "desc": "พัฒนาแอปตรวจจับวัตถุแบบเรียลไทม์บน Android โดยใช้โมเดล YOLO แปลงเป็น NCNN เพื่อเพิ่มประสิทธิภาพบนอุปกรณ์พกพา โดยใช้ภาษา Kotlin และเชื่อมต่อกับ Native C++ ผ่าน JNI พร้อมทั้งเชื่อมต่อและบันทึกข้อมูลแบบเรียลไทม์ผ่าน Firebase"
    },
    "id3": {
      "company": "งานส่วนตัว",
      "date": "2564 - ปัจจุบัน",
      "desc": "พัฒนาโปรแกรม Desktop ด้วยภาษา Python สำหรับควบคุมอุปกรณ์ Android ผ่าน ADB และดึงภาพหน้าจอด้วย Scrcpy พัฒนาระบบตรวจจับวัตถุแบบเรียลไทม์ด้วยโมเดล YOLO ที่แปลงเป็น ONNX เพื่อเพิ่มประสิทธิภาพการทำงาน พร้อมทั้งเชื่อมต่อและบันทึกข้อมูลแบบเรียลไทม์ผ่าน Firebase"
    }
  },

  "componentEducation": {
    "grade": "เกรดเฉลี่ย ",
    "id1": {
      "degree": "เทคโนโลยีสารสนเทศ",
      "school": "มหาวิทยาลัยราชภัฏสุรินทร์",
      "date": "สิงหาคม 2558 - มีนาคม 2562",
      "desc": "จบปริญญาตรี ระดับวิทยาศาสตรบัณฑิต สาขาวิทยาศาสตร์ สาขาวิชาเทคโนโลยีสารสนเทศ"
    },
    "id2": {
      "degree": "มัธยมศึกษาตอนปลาย",
      "school": "โรงเรียนแนงมุดวิทยา",
      "date": "พฤษภาคม 2555 - มีนาคม 2558",
      "desc": "จบชั้นมัธยมศึกษาตอนปลาย ที่โรงเรียนแนงมุดวิทยา ตำบลแนงมุด อำเภอกาบเชิง จังหวัดสุรินทร์"
    },
    "id3": {
      "degree": "มัธยมศึกษาตอนต้น",
      "school": "โรงเรียนแนงมุดวิทยา",
      "date": "พฤษภาคม 2552 - มีนาคม 2555",
      "desc": "จบชั้นมัธยมศึกษาตอนต้น ที่โรงเรียนแนงมุดวิทยา ตำบลแนงมุด อำเภอกาบเชิง จังหวัดสุรินทร์"
    },
    "id4": {
      "degree": "ประถมศึกษา",
      "school": "โรงเรียนนิคมสร้างตนเองปราสาท2",
      "date": "",
      "desc": "จบชั้นประถมศึกษา ที่โรงเรียนนิคมสร้างตนเองปราสาท2 ตำบลแนงมุด อำเภอกาบเชิง จังหวัดสุรินทร์"
    }
  }
}
